Repository: yurj/z3c.form
Catalog: src/z3c/form/locales/*/LC_MESSAGES/z3c.form.po
Languages: eu

source: Add
eu: Gehitu

source: Remove selected
eu: Ezabatu aukeratutakoak

source: No value
eu: Baliorik ez

source: Select a value ...
eu: Aukeratu bat...

source: The entered value is not a valid integer literal.
eu: Sartutako balioa ez da zenbaki oso bat.

source: The entered value is not a valid decimal literal.
eu: Sartutako balioa ez da zenbaki dezimal bat.

source: Bytes data are not a file object
eu: Byte erako datuak ez dira fitxategi objektu bat

source: The system could not process the given value.
eu: Sistemak ezin izan du sartutako balioa prozesatu.

source: <span class="required">*</span>&ndash; required
eu: <span class="required">*</span>&ndash; beharrezkoa

source: There were some errors.
eu: Errore batzuk daude.

source: Data successfully updated.
eu: Datuak ondo eguneratu dira.

source: No changes were applied.
eu: Ez da aldaketarik gorde.

source: Apply
eu: Gorde

source: Context
eu: Kontestua

source: The context in which the data are validated.
eu: Datuak zein kontestutan egiaztatuko diren.

source: Widget
eu: Widgeta

source: The widget that the view is on
eu: Widgeta zein bistatan dagoen

source: Error
eu: Errorea

source: Error the view is for.
eu: Errorea zein bistarentzat den.

source: Title
eu: Izenburua

source: The name of the field within the form.
eu: Eremuak formularioan duen izena.

source: Schema Field
eu: Eskemako eremua

source: The schema field that is to be rendered.
eu: Erakutsiko den eremua.

source: Prefix
eu: Aurrizkia

source: The prefix of the field used to avoid name clashes.
eu: Izenak ez errepikatzeko eremuari gehituko zaion aurrizkia.

source: Mode
eu: Modua

source: The mode in which to render the widget for the field.
eu: Eremuaren widgeta erakusteko erabiliko den modua.

source: Interface
eu: Interfazea

source: The interface from which the field is coming.
eu: Eremuaren interfazea.

source: Ignore Context
eu: Kontestuari kasurik ez egin

source: A flag, when set, forces the widget not to look at the context for a value.
eu: Widgetak balio baten kontestua kontuan hartu behar ez duenean aktibatu aukera hau.

source: Widget Factory
eu: Widget sortzailea

source: The widget factory.
eu: Widget sortzailea.

source: Show default value
eu: Erakutsi defektuzko balioa

source: A flag, when set, makes the widget to displayfield|adapter provided default values.
eu: Ezarrita dagoenean, widgetak emandako defektuzko balioak erakutsiko ditu.

source: True-value Label
eu: Egiazkoaren etiketa

source: The label for a true value of the Bool field.
eu: Eremu boolearrean egiazko elementuak izango duen etiketa.

source: False-value Label
eu: Faltsuaren etiketa

source: The label for a false value of the Bool field.
eu: Eremu boolearrean elementu faltsuak izango duen etiketa.

source: Name
eu: Izena

source: The name the widget is known under.
eu: Widgetaren izena.

source: Label
eu: Etiketa

source: The widget label. Label may be translated for the request. The attribute may be implemented as either a read-write or read-only property, depending on the requirements for a specific implementation.
eu: Widgetaren etiketa. Etiketa itzuli egin daiteke, Atributua irakurri-eta-idazteko edo irakurtzeko-bakarrik moduan inplementatu daiteke, inplementazio zehatzaren baldintzen arabera

source: A widget mode.
eu: Widgetaren modua.

source: Required
eu: Beharrezkoa

source: If true the widget should be displayed as required input.
eu: Egiazkoa bada, widgetean balioren bat bete beharko da.

source: If an error occurred during any step, the error view stored here.
eu: Pausoren baten erroreren bat gertatzen bada, errore bista hemen gordeko da.

source: Value
eu: Balioa

source: The value that the widget represents.
eu: Widgetak erakusten duen balioa.

source: Ignore Request
eu: Eskaerari kasurik ez egin

source: A flag, when set, forces the widget not to look at the request for a value.
eu: Widgetak balio bat erakustean eskaera kontuan hartu behar ez duenean aktibatu aukera hau.

source: Set errors
eu: Gorde erroreak

source: A flag, when set, the widget sets error messages on calling extract().
eu: Ezarrita dagoenean, widgetak errore mezuak extract()-i deitzean ezartzen ditu.

source: Ignore Required validation
eu: Baztertu derrigorrezkoen egiaztapena

source: If set then required fields will pass validation regardless whether they're filled in or not
eu: Ezarrita badago, balioak erauztean derrigorrezko eremuak balidazioa pasatu egingo dute berdin delarik beteta egon ala ez

source: NO_VALUE Token
eu: "Baliorik ez" balioa gordetzeko tokena

source: The token to be used, if no value has been selected.
eu: Baliorik ez badago gordeko den tokena.

source: Terms
eu: Terminoak

source: A component that provides the options for selection.
eu: Aukeraketarentzat balioak ematen dituen osagaia.

source: Prompt
eu: Aukeratu

source: A flag, when set, enables a choice explicitely requesting the user to choose a value.
eu: Ezarrita dagoenean, erabiltzaileari balio bat aukeratzeko aukera bat gehitzen du.

source: Items
eu: Elementuak

source: A collection of dictionaries containing all pieces of information for rendering. The following keys must be in each dictionary: id, value, content, selected
eu: Erakusteko informazioa duten hiztegi zerrendak. Gako hauek derrigorrezkoak dira: id, value, content, selected

source: No-Value Message
eu: Baliorik ez dagoenean agertuko den mezua

source: A human-readable text that is displayed to refer the missing value.
eu: Falta den balioa adierazteko agertuko den mezua.

source: Prompt Message
eu: Aukeratzeko mezua

source: The prefix of the widgets.
eu: Widgeten aurrizkia.

source: Errors
eu: Erroreak

source: The collection of errors that occured during validation.
eu: Egiaztapena egitean gertatu den errore-multzoa.

source: If set the context is ignored to retrieve a value.
eu: Ezarrita badago, kontestua ez da kontuan hartuko balioa lortzean.

source: If set the request is ignored to retrieve a value.
eu: Ezarrita badago, eskaera ez da kontuan hartuko balioa lortzean.

source: Ignore Readonly
eu: Baztertu irakurtzekoak bakarrik

source: If set then readonly fields will also be shown.
eu: Ezarrita badago, irakurtzeko bakarrik diren eremuak ere erakutsi egingo dira.

source: Ignore Required validation on extract
eu: Baztertu beharrezkoen egiaztapean balioak erauztean

source: If set then required fields will pass validation on extract regardless whether they're filled in or not
eu: Ezarrita badago, balioak erauztean derrigorrezko eremuak balidazioa pasatu egingo dute berdin delarik beteta egon ala ez

source: Has required fields
eu: Beharrezko eremuak ditu

source: A flag set when at least one field is marked as required
eu: Gutxienez eremu bat beharrezkoa denean ezartzen den marka

source: A flag, when set, the contained widgets set error messages on calling extract().
eu: Ezarrita dagoenean, widgetek erroreak extract()-i deitzean ezarriko dituzte.

source: Field
eu: Eremua

source: The schema field which the widget is representing.
eu: Widgetak errepresentatzen duen eskemako eremua.

source: The object name.
eu: Objektuaren izena.

source: The action title.
eu: Akzioaren izena.

source: Action
eu: Akzioa

source: The action for which the event is created.
eu: Gertaerarentzat sortzen den akzioa.

source: The error that occurred during the action.
eu: Akzioan zehar gertatu den errorea.

source: Access Key
eu: Sarbide-tekla

source: The key when pressed causes the button to be pressed.
eu: Sakatzen denean botoia sakatzea eragiten duen tekla.

source: Action Factory
eu: Akzio sortzailea

source: The action factory.
eu: Akzio sortzailea.

source: Image Path
eu: Irudiaren kokalekua

source: A relative image path to the root of the resources.
eu: Baliabideak dauden tokitik ezartzen den bide erlatiboa.

source: Handlers
eu: Kudeatzaileak

source: A list of action handlers defined on the form.
eu: Formularioan ezarritako akzio kudeatzaileen zerrenda.

source: Actions
eu: Akzioak

source: A list of actions defined on the form
eu: Formularioan definitutako akzio zerrenda

source: Refresh actions
eu: Freskatu akzioak

source: A flag, when set, causes form actions to be updated again after their execution.
eu: Ezarrita dagoenean, akzioak exekutatu ostean berriz eguneratuko dira.

source: The context in which the widget is displayed.
eu: Widgeta erakusten den kontestua.

source: The mode in which to render the widgets.
eu: Widgetak erakusteko modua.

source: Widgets
eu: Widgetak

source: A widget manager containing the widgets to be used in the form.
eu: Formularioan erabiliko diren widgetak dituen kudeatzailea.

source: A human readable text describing the form that can be used in the UI.
eu: Formularioa deskribatzen duen testua.

source: Label required
eu: Derrigorrezkoaren etiketa

source: A human readable text describing the form that can be used in the UI for rendering a required info legend.
eu: Formularioan erakutsi daitekeen beharrezkoaren inguruko testua.

source: The prefix of the form used to uniquely identify it.
eu: Formularioa identifikatzeko erabiliko den aurrizkia.

source: Status
eu: Egoera

source: The status message of the form.
eu: Formularioaren egoera-mezua.

source: The action defines the URI to which the form data are sent.
eu: Formularioko datuak bidaltzen direneko URIa.

source: The name of the form used to identify it.
eu: Formularioa identifikatzeko izena.

source: The id of the form used to identify it.
eu: Formularioa identifikatzeko ida.

source: Method
eu: Metodoa

source: The HTTP method used to submit the form.
eu: Formularioa bidaltzeko erabiliko den HTTP metodoa.

source: Encoding Type
eu: Kodeketa

source: The data encoding used to submit the data safely.
eu: Formularioa bidaltzean erabiliko den kodeketa.

source: Accepted Character Sets
eu: Onartzen diren karaktere-multzoak

source: This is a list of character sets the server accepts. By default this is unknown.
eu: Zerbitzariak onartzen dituen karaktere-multzoak. Defektuzko balioa unknown (ezezaguna) da.

source: Accepted Content Types
eu: Onartutako motak

source: This is a list of content types the server can safely handle.
eu: Zerbitzariak onar ditzakeen eskaera-motak (Content-Type goiburukoa)

source: Fields
eu: Eremuak

source: A field manager describing the fields to be used for the form.
eu: Formularioak erabiliko dituen eremuen kudeatzailea.

source: Content providers
eu: Eduki-jatorriak

source: A manager describing the content providers to be used for the form.
eu: Formularioak erabiliko dituen eduki-jatorriak.

source: Buttons
eu: Botoiak

source: A button manager describing the buttons to be used for the form.
eu: Formularioak erabiliko dituen botoien kudeatzailea.

source: The widget for which the event was created.
eu: Gertaerarentzat sortzen den widgeta.

source: Missing: ${value}
eu: Balio hau falta da: ${value}

source: yes
eu: bai

source: no
eu: ez

source: Missing filename extension.
eu: Fitxategiaren luzapena falta da.

source: Layout template.
eu: Itxuraren txantiloia.

source: Refers to a file containing a page template (should end in extension ``.pt`` or ``.html``).
eu: Txantiloia duen fitxategiaren erreferentiza (``.pt`` edo ``.html`` luzapena izan beharko luke).

source: The mode of the template.
eu: Txantiloiaren modua.

source: The mode is used to define input and display templates
eu: Modua txantiloiak definitu eta erakusteko erabiltzen da

source: View
eu: Bista

source: The view for which the template should be available
eu: Txantiloia zein bistarentzat erabili behar den

source: Layer
eu: Geruza

source: The layer for which the template should be available
eu: Txantiloia zein geruzarentzat erabili behar den

source: The field for which the template should be available
eu: Txantiloia zein eremurentzat erabili behar den

source: The widget for which the template should be available
eu: Txantiloia zein widgetentzat erabili behar den

source: Content Type
eu: Elementu-mota

source: The content type identifies the type of data.
eu: Elementu-motak datu-mota identifikatzen du.

source: Schema
eu: Eskema

source: The schema of the field for which the template should be available
eu: Txantiloia eskemaren zein eremurentzat erabili behar den
